---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager
source: html/27b2b2be-dbef-f148-b92f-a355294a89b0.htm
---
# AnalyticalToPhysicalAssociationManager Members

Adds a new association between an analytical element and a physical element.